tiborsimon/embedded-tdd-headers/pic/8bit/pic16f1578_tdd.h
#define PWM3LDS1                      1091
#define PWM3LDCON_LDS1                1092
#define PWM3LDCON_LDT                 1093
#define PWM3LDM                       1094
#define PWM3LDCON_LDA                 1095
#define PWM3LD                        1096
#define PWM3OFCON                     1097
#define PWM3OFS                       1098
#define PWM3OFCON_OFS0                1099
#define PWM3OFS0                      1100
#define PWM3OFCON_OFS                 1101
#define PWM3OFCON_OFS1                1102
#define PWM3OFS1                      1103
#define PWM3OFMC                      1104
#define PWM3OFCON_OFO                 1105
#define PWM3OFM0                      1106
#define PWM3OFCON_OFM0                1107
#define PWM3OFCON_OFM                 1108
#define PWM3OFM                       1109
#define PWM3OFM1                      1110
#define PWM3OFCON_OFM1                1111
#define PWM4PHL_PH                    1112
#define PWM4PHL                       1113
#define PWM4PHL0                      1114
#define PWM4PHL1                      1115
#define PWM4PHL2                      1116
#define PWM4PHL3                      1117
#define PWM4PHL4                      1118
#define PWM4PHL5                      1119
#define PWM4PHL6                      1120
#define PWM4PHL7                      1121
#define PWM4PHH                       1122
#define PWM4PHH0                      1123
#define PWM4PHH_PH                    1124
#define PWM4PHH1                      1125
#define PWM4PHH2                      1126
#define PWM4PHH3                      1127
#define PWM4PHH4                      1128
#define PWM4PHH5                      1129
#define PWM4PHH6                      1130
#define PWM4PHH7                      1131
#define PWM4DCL0                      1132
#define PWM4DCL                       1133
#define PWM4DCL_DC                    1134
#define PWM4DCL1                      1135
#define PWM4DCL2                      1136
#define PWM4DCL3                      1137
#define PWM4DCL4                      1138
#define PWM4DCL5                      1139
#define PWM4DCL6                      1140
#define PWM4DCL7                      1141
#define PWM4DCH0                      1142
#define PWM4DCH                       1143
#define PWM4DCH_DC                    1144
#define PWM4DCH1                      1145
#define PWM4DCH2                      1146
#define PWM4DCH3                      1147
#define PWM4DCH4                      1148
#define PWM4DCH5                      1149
#define PWM4DCH6                      1150
#define PWM4DCH7                      1151
#define PWM4PRL_PR                    1152
#define PWM4PRL                       1153
#define PWM4PRL0                      1154
#define PWM4PRL1                      1155
#define PWM4PRL2                      1156
#define PWM4PRL3                      1157
#define PWM4PRL4                      1158
#define PWM4PRL5                      1159
#define PWM4PRL6                      1160
#define PWM4PRL7                      1161
#define PWM4PRH0                      1162
#define PWM4PRH                       1163
#define PWM4PRH_PR                    1164
#define PWM4PRH1                      1165
#define PWM4PRH2                      1166
#define PWM4PRH3                      1167
#define PWM4PRH4                      1168
#define PWM4PRH5                      1169
#define PWM4PRH6                      1170
#define PWM4PRH7                      1171
#define PWM4OFL0                      1172
#define PWM4OFL                       1173
#define PWM4OFL_OF                    1174
#define PWM4OFL1                      1175
#define PWM4OFL2                      1176
#define PWM4OFL3                      1177
#define PWM4OFL4                      1178
#define PWM4OFL5                      1179
#define PWM4OFL6                      1180
#define PWM4OFL7                      1181
#define PWM4OFH                       1182
#define PWM4OFH_OF                    1183
#define PWM4OFH0                      1184
#define PWM4OFH1                      1185
#define PWM4OFH2                      1186
#define PWM4OFH3                      1187
#define PWM4OFH4                      1188
#define PWM4OFH5                      1189
#define PWM4OFH6                      1190
#define PWM4OFH7                      1191
#define PWM4TMRL0                     1192
#define PWM4TMRL_TMR                  1193
#define PWM4TMRL                      1194
#define PWM4TMRL1                     1195
#define PWM4TMRL2                     1196
#define PWM4TMRL3                     1197
#define PWM4TMRL4                     1198
#define PWM4TMRL5                     1199
#define PWM4TMRL6                     1200
#define PWM4TMRL7                     1201
#define PWM4TMRH                      1202
#define PWM4TMRH_TMR                  1203
#define PWM4TMRH0                     1204
#define PWM4TMRH1                     1205
#define PWM4TMRH2                     1206
#define PWM4TMRH3                     1207
#define PWM4TMRH4                     1208
#define PWM4TMRH5                     1209
#define PWM4TMRH6                     1210
#define PWM4TMRH7                     1211
#define PWM4CON                       1212
#define PWM4MODE                      1213
#define PWM4MODE0                     1214
#define PWM4CON_MODE                  1215
#define PWM4CON_MODE0                 1216
#define PWM4CON_MODE1                 1217
#define PWM4MODE1                     1218
#define PWM4POL                       1219
#define PWM4CON_POL                   1220
#define PWM4CON_OUT                   1221
#define PWM4OUT                       1222
#define PWM4CON_OE                    1223
#define PWM4OE                        1224
#define PWM4EN                        1225
#define PWM4CON_EN                    1226
#define PWM4INTE                      1227
#define PWM4INTE_PRIE                 1228
#define PWM4PRIE                      1229
#define PWM4INTE_DCIE                 1230
#define PWM4DCIE                      1231
#define PWM4PHIE                      1232
#define PWM4INTE_PHIE                 1233
#define PWM4OFIE                      1234
#define PWM4INTE_OFIE                 1235
#define PWM4INTF                      1236
#define PWM4PRIF                      1237
#define PWM4INTF_PRIF                 1238
#define PWM4INTF_DCIF                 1239
#define PWM4DCIF                      1240
#define PWM4PHIF                      1241
#define PWM4INTF_PHIF                 1242
#define PWM4OFIF                      1243
#define PWM4INTF_OFIF                 1244
#define PWM4CLKCON                    1245
#define PWM4CLKCON_CS0                1246
#define PWM4CS                        1247
#define PWM4CLKCON_CS                 1248
#define PWM4CS0                       1249
#define PWM4CLKCON_CS1                1250
#define PWM4CS1                       1251
#define PWM4PS0                       1252
#define PWM4CLKCON_PS0                1253
#define PWM4CLKCON_PS                 1254
#define PWM4PS                        1255
#define PWM4PS1                       1256
#define PWM4CLKCON_PS1                1257
#define PWM4PS2                       1258
#define PWM4CLKCON_PS2                1259
#define PWM4LDCON                     1260
#define PWM4LDS                       1261
#define PWM4LDCON_LDS0                1262
#define PWM4LDCON_LDS                 1263
#define PWM4LDS0                      1264
#define PWM4LDCON_LDS1                1265
#define PWM4LDS1                      1266
#define PWM4LDM                       1267
#define PWM4LDCON_LDT                 1268
#define PWM4LDCON_LDA                 1269
#define PWM4LD                        1270
#define PWM4OFCON                     1271
#define PWM4OFCON_OFS                 1272
#define PWM4OFS                       1273
#define PWM4OFCON_OFS0                1274
#define PWM4OFS0                      1275
#define PWM4OFCON_OFS1                1276
#define PWM4OFS1                      1277
#define PWM4OFMC                      1278
#define PWM4OFCON_OFO                 1279
#define PWM4OFM0                      1280
#define PWM4OFM                       1281
#define PWM4OFCON_OFM0                1282
#define PWM4OFCON_OFM                 1283
#define PWM4OFM1                      1284
#define PWM4OFCON_OFM1                1285
#define PPSLOCK                       1286
#define PPSLOCKED                     1287
#define INTPPS0                       1288
#define INTPPS                        1289
#define INTPPS1                       1290
#define INTPPS2                       1291
#define INTPPS3                       1292
#define INTPPS4                       1293
#define T0CKIPPS0                     1294
#define T0CKIPPS                      1295
#define T0CKIPPS1                     1296
#define T0CKIPPS2                     1297
#define T0CKIPPS3                     1298
#define T0CKIPPS4                     1299
#define T1CKIPPS0                     1300
#define T1CKIPPS                      1301
#define T1CKIPPS1                     1302
#define T1CKIPPS2                     1303
#define T1CKIPPS3                     1304
#define T1CKIPPS4                     1305
#define T1GPPS0                       1306
#define T1GPPS                        1307
#define T1GPPS1                       1308
#define T1GPPS2                       1309
#define T1GPPS3                       1310
#define T1GPPS4                       1311
#define CWG1INPPS0                    1312
#define CWG1INPPS                     1313
#define CWG1INPPS1                    1314
#define CWG1INPPS2                    1315
#define CWG1INPPS3                    1316
#define CWG1INPPS4                    1317
#define RXPPS0                        1318
#define RXPPS                         1319
#define RXPPS1                        1320
#define RXPPS2                        1321
#define RXPPS3                        1322
#define RXPPS4                        1323
#define CKPPS                         1324
#define CKPPS0                        1325
#define CKPPS1                        1326
#define CKPPS2                        1327
#define CKPPS3                        1328
#define CKPPS4                        1329
#define ADCACTPPS0                    1330
#define ADCACTPPS                     1331
#define ADCACTPPS1                    1332
#define ADCACTPPS2                    1333
#define ADCACTPPS3                    1334
#define ADCACTPPS4                    1335
#define RA0PPS                        1336
#define RA0PPS0                       1337
#define RA0PPS1                       1338
#define RA0PPS2                       1339
#define RA0PPS3                       1340
#define RA1PPS                        1341
#define RA1PPS0                       1342
#define RA1PPS1                       1343
#define RA1PPS2                       1344
#define RA1PPS3                       1345
#define RA2PPS                        1346
#define RA2PPS0                       1347
#define RA2PPS1                       1348
#define RA2PPS2                       1349
#define RA2PPS3                       1350
#define RA4PPS                        1351
#define RA4PPS0                       1352
#define RA4PPS1                       1353
#define RA4PPS2                       1354
#define RA4PPS3                       1355
#define RA5PPS                        1356
#define RA5PPS0                       1357
#define RA5PPS1                       1358
#define RA5PPS2                       1359
#define RA5PPS3                       1360
#define RB4PPS                        1361
#define RB4PPS0                       1362
#define RB4PPS1                       1363
#define RB4PPS2                       1364
#define RB4PPS3                       1365
#define RB5PPS                        1366
#define RB5PPS0                       1367
#define RB5PPS1                       1368
#define RB5PPS2                       1369
#define RB5PPS3                       1370
#define RB6PPS0                       1371
#define RB6PPS                        1372
#define RB6PPS1                       1373
#define RB6PPS2                       1374
#define RB6PPS3                       1375
#define RB7PPS0                       1376
#define RB7PPS                        1377
#define RB7PPS1                       1378
#define RB7PPS2                       1379
#define RB7PPS3                       1380
#define RC0PPS                        1381
#define RC0PPS0                       1382
#define RC0PPS1                       1383
#define RC0PPS2                       1384
#define RC0PPS3                       1385
#define RC1PPS_RC1PPS0                1386
#define RC1PPS                        1387
#define RC1PPS_RC1PPS1                1388
#define RC1PPS_RC1PPS2                1389
#define RC1PPS_RC1PPS3                1390
#define RC2PPS_RC1PPS0                1391
#define RC2PPS                        1392
#define RC2PPS_RC1PPS1                1393
#define RC2PPS_RC1PPS2                1394
#define RC2PPS_RC1PPS3                1395
#define RC3PPS                        1396
#define RC3PPS0                       1397
#define RC3PPS1                       1398
#define RC3PPS2                       1399
#define RC3PPS3                       1400
#define RC4PPS0                       1401
#define RC4PPS                        1402
#define RC4PPS1                       1403
#define RC4PPS2                       1404
#define RC4PPS3                       1405
#define RC5PPS0                       1406
#define RC5PPS                        1407
#define RC5PPS1                       1408
#define RC5PPS2                       1409
#define RC5PPS3                       1410
#define RC6PPS                        1411
#define RC6PPS0                       1412
#define RC6PPS1                       1413
#define RC6PPS2                       1414
#define RC6PPS3                       1415
#define RC7PPS                        1416
#define RC7PPS0                       1417
#define RC7PPS1                       1418
#define RC7PPS2                       1419
#define RC7PPS3                       1420
#define STATUS_SHAD                   1421
#define C_SHAD                        1422
#define DC_SHAD                       1423
#define Z_SHAD                        1424
#define WREG_SHAD                     1425
#define BSR_SHAD                      1426
#define PCLATH_SHAD                   1427
#define FSR0L_SHAD                    1428
#define FSR0H_SHAD                    1429
#define FSR1L_SHAD                    1430
#define FSR1H_SHAD                    1431
#define STKPTR                        1432
#define TOSL                          1433
#define TOSH                          1434

#endif // _PIC16F1578_H_
